#include <stdio.h>

int main()
{
    int a[10][10] =
    {
        {1},
        {1, 1},
        {1, 2, 1},
        {1, 3, 3, 1},
        {1, 4, 6, 4, 1},
        {1, 5, 10, 10, 5, 1},
        {1, 6, 15, 20, 15, 6, 1},
        {1, 7, 21, 35, 35, 21, 7, 1},
        {1, 8, 28, 56, 70, 56, 28, 8, 1},
        {1, 9, 36, 84, 126, 126, 84, 36, 9, 1},
    };
    int n = 0;
    int sw = 1;
    scanf("%d", &n);
    printf("input lines : \n",n);
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < sw; j++)
        {
			if(a[i][j]==0){
				continue;
			}
			if(a[i][j]<10){
                printf("   %d",a[i][j]);}
            else if(a[i][j]<100){
                printf("  %d",a[i][j]);
            }else printf(" %d",a[i][j]);


        }
		sw++;
		printf("\n");

    }

    return 0;
}

/* 杨辉三角
编程打印具有如下形式的杨辉三角形（它的特点是左右两边全是1，从第二行起，中间的每一个数是上一行里相邻两个数之和），其中输出数据的行数n从键盘输入，并且n<=10。

程序运行结果示例1：
input lines : 5↙
   1
   1   1
   1   2   1
   1   3   3   1
   1   4   6   4   1

程序运行结果示例2：
input lines : 7↙
   1
   1   1
   1   2   1
   1   3   3   1
   1   4   6   4   1
   1   5  10  10   5   1
   1   6  15  20  15   6   1 */